#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#	หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#	หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#	หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
#	หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#	หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('.................................')
print('     โปรแกรมตรวจสอบข้อมูลสายรถเมล์      ')
print('.................................')

Bus_line = int(input('ป้อนสายรถเมล์ที่คุณต้องการ'))
print('.................................')
if Bus_line == 57 :
    print('สาย 57 ไปปิ่นเกล้า บางขุนนนท์')
elif Bus_line == 3 :
    print('สาย 3 สนามหลวง ลาดพร้าว')
elif Bus_line == 71 :
    print('สาย 71 ไปหัวลำโพง เยาวราช')
elif Bus_line == 56 :
    print('สาย 56 ไปบางลำพู สะพานกรุงธน')
elif Bus_line == 539 :
    print('สาย 539 ไปอนุสวรีย์ชัย สามเสน')
else :
    print('ยังไม่มีข้อมูล')
print('.................................')