# กรณี 1 print มีข้อมูลหลายอย่าง
# วิธีที่ 1 ใช้ , ()
print("Hello", "World", 123, 456.789, True,'Hi',10 + 20 + 89)

# วิธีที่ 2 ใช้ + จะต้องเป็น String เท่านั้น str())
# ไม่มีเว้น 1 space เหมือน ,
print("Hello"+"World"+str(123),str(456.789)+str(True)+'Hi'+str(10 + 20 + 89))

# วิธีที่3 ใช้ เมธอด format() โคยข้อมมุล ที่แสดงอยู่ในรูปของ string
# (ข้อมูลที่ไม่ใช่ string ให้ใส่ใน () ของ Format และคตำแหน่งที่แสดงข้อมูลให้ใส่ () แทน )
print('Hello {} Wow {} {} hi {} {} '.format(555,9999,True,10+5+2+7+6,155.785))
# index numder          0    1    2    3    4
print('{2} {4}'.format('a', 'b', 'c', 'd', 'e'))

# วิธีที่ 4 ใช้ f-string โดยข้อมูลที่แสดงอยู่ในรูปของ string โดยมี F ข้างหน้า
# (ข้อมูลที่ไม่ใช่) string ให้เขียนใน {} ณ ตำปหน่งนั้นๆ เลย )
print(f'Hello {888} WOW {555} {True} Hi {10+80+740} {152.7787}')