# Assingnment Operator กำหนดค่า คือ เครื่องหมาย - 
# การทำงานของ = คือ เอาทางขวาไปใส่ทางซ้าย
# ยกเว้นเสียแต่ว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (variable) ข้อมูล (data)/นิพจน์ (Expression)
# *** ตัวแปร (variabela) คือ ชื่อที่ Dev ตั้งชื่อมาเองไว้เก็บข้อมูล ***
# *** การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บข้อมูลมาใข้ ***

score = 20 
fullname = 'สมชาย'
salery = input('ป้องเงินเดือน')
sum = 20 + 30 
print('---------------------------')
num = 10 
# ตำดำเนินการกำหนดค่าอย่างย่อ
num += 10 # num = num + 10
num -= 10 # num = num -10 
num *= 10 # num = num * 2
num /= 2  # num = num / 2
num %= 2  # num = num % 2
num //= 2 # num = num // 2
print(num)
print('----------------------------')
